; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v8 ?v6)
             (pred_1 ?v12 ?v11)
             (pred_11 ?v8 ?v11)
             (pred_6 ?v13 ?v8 )
	     (pred_9 ?v8)
             (pred_5 ?v7)
             (pred_2 ?v12)
             (pred_4 ?v11)
             (pred_12 ?v8)
             (pred_7 ?v12)
             (pred_3 ?v8)
             (pred_10 ))



(:action op_1
:parameters (?v10 ?v2 ?v1 ?v4)
:precondition (and (pred_5 ?v10) (pred_5 ?v2) (pred_2 ?v1) (pred_4 ?v4)
          (pred_8 ?v10 ?v2) (pred_1 ?v1 ?v4)
                   (pred_11 ?v2 ?v4) (pred_9 ?v10) 
                   (pred_12 ?v2) (pred_7 ?v1))
:effect (and  (pred_3 ?v2) (not (pred_12 ?v2))))


(:action op_2
:parameters (?v10 ?v3)
:precondition (and (pred_5 ?v10) (pred_5 ?v3)
               (pred_9 ?v10) (pred_8 ?v10 ?v3) (pred_3 ?v3))
:effect (and (pred_9 ?v3) (not (pred_9 ?v10))))

(:action op_5
:parameters (?v10 ?v1)
:precondition (and (pred_5 ?v10) (pred_2 ?v1) 
                  (pred_9 ?v10) (pred_6 ?v1 ?v10) (pred_10 ))
:effect (and (pred_7 ?v1)
   (not (pred_6 ?v1 ?v10)) (not (pred_10 ))))


(:action op_4
:parameters (?v10 ?v5 ?v9)
:precondition (and (pred_5 ?v10) (pred_2 ?v5) (pred_2 ?v9)
                  (pred_9 ?v10) (pred_7 ?v9) (pred_6 ?v5 ?v10))
:effect (and (pred_7 ?v5) (pred_6 ?v9 ?v10)
        (not (pred_7 ?v9)) (not (pred_6 ?v5 ?v10))))

(:action op_3
:parameters (?v10 ?v1)
:precondition (and (pred_5 ?v10) (pred_2 ?v1) 
                  (pred_9 ?v10) (pred_7 ?v1))
:effect (and (pred_10 ) (pred_6 ?v1 ?v10) (not (pred_7 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_16 obj_12 obj_09 obj_21 obj_18 obj_01 obj_02 obj_05 obj_20 obj_14 obj_08 obj_13 obj_11 obj_19 obj_22
    obj_04 obj_17 obj_03
    obj_06 obj_10 obj_15
    )

    (:init
       (pred_10)

       (pred_5 obj_07)
       (pred_5 obj_16)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_21)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_05)
       (pred_5 obj_20)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_11)
       (pred_5 obj_19)
       (pred_5 obj_22)
       (pred_4 obj_04)
       (pred_4 obj_17)
       (pred_4 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_10)
       (pred_2 obj_15)

       (pred_8 obj_07 obj_21)
       (pred_8 obj_07 obj_16)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_16 obj_07)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_09)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_09 obj_02)
       (pred_8 obj_09 obj_12)
       (pred_8 obj_21 obj_05)
       (pred_8 obj_21 obj_18)
       (pred_8 obj_21 obj_07)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_21)
       (pred_8 obj_01 obj_14)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_01 obj_18)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_02 obj_09)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_05 obj_21)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_14 obj_08)
       (pred_8 obj_14 obj_01)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_08 obj_22)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_08 obj_14)
       (pred_8 obj_13 obj_11)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_13)
       (pred_8 obj_19 obj_22)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_22 obj_08)
       (pred_8 obj_22 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_19)
       (pred_12 obj_18)
       (pred_11  obj_08 obj_04)
       (pred_11  obj_19 obj_17)
       (pred_11  obj_18 obj_03)
       (pred_3 obj_07)
       (pred_3 obj_16)
       (pred_3 obj_12)
       (pred_3 obj_09)
       (pred_3 obj_21)
       (pred_3 obj_01)
       (pred_3 obj_02)
       (pred_3 obj_05)
       (pred_3 obj_20)
       (pred_3 obj_14)
       (pred_3 obj_13)
       (pred_3 obj_11)
       (pred_3 obj_22)

       (pred_1  obj_06 obj_04)
       (pred_1  obj_10 obj_17)
       (pred_1  obj_15 obj_03)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_10 obj_12)
       (pred_6 obj_15 obj_13)
       (pred_9 obj_02)
    )

    (:goal (and
       (pred_6 obj_15 obj_01)
    ))
(:constraints
  (always (not (pred_9 obj_14)))
)
)

; plan
1. (op_2 obj_02 obj_09)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_09)
   goals met: 0 of 1
2. (op_2 obj_09 obj_12)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_12)
   goals met: 0 of 1
3. (op_2 obj_12 obj_16)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_16)
   goals met: 0 of 1
4. (op_2 obj_16 obj_07)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_07)
   goals met: 0 of 1
5. (op_2 obj_07 obj_21)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_21)
   goals met: 0 of 1
6. (op_2 obj_21 obj_05)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_05)
   goals met: 0 of 1
7. (op_2 obj_05 obj_13)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_13)
   goals met: 0 of 1
8. (op_5 obj_13 obj_15)
   deleted: (pred_6 obj_15 obj_13) (pred_10)
   added: (pred_7 obj_15)
   goals met: 0 of 1
9. (op_2 obj_13 obj_05)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_05)
   goals met: 0 of 1
10. (op_2 obj_05 obj_20)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_20)
   goals met: 0 of 1
11. (op_1 obj_20 obj_18 obj_15 obj_03)
   deleted: (pred_12 obj_18)
   added: (pred_3 obj_18)
   goals met: 0 of 1
12. (op_2 obj_20 obj_18)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_18)
   goals met: 0 of 1
13. (op_2 obj_18 obj_01)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_01)
   goals met: 0 of 1
14. (op_3 obj_01 obj_15)
   deleted: (pred_7 obj_15)
   added: (pred_10) (pred_6 obj_15 obj_01)
   goals met: 1 of 1
